tap "databricks/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kreuzwerker/taps"
tap "microsoft/git"
# General-purpose data compression with high compression ratio
brew "xz"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Parser generator
brew "bison"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Ruby environment tool
brew "chruby"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Bash, Zsh and Fish completion for Docker
brew "docker-completion", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Library for command-line editing
brew "readline"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# YAML Parser
brew "libyaml"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Simple, correct PEP 517 build frontend
brew "python-build"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Terraform
brew "hashicorp/tap/terraform"
# CLI to support with downloading and compiling terraform providers for Mac with M1 chip.
brew "kreuzwerker/taps/m1-terraform-provider-helper"
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Application uninstaller
cask "appcleaner"
# Utility to create and modify archives
cask "betterzip"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Screen color temperature controller
cask "flux"
# Clipboard manager for developers
cask "flycut"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# QuickLook plugin to view patch files
cask "qlprettypatch"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Text editor for code, markup and prose
cask "sublime-text"
# Backup, recovery and cloning software
cask "superduper"
# Data visualization software
cask "tableau"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# QuickLook plugin for webp files
cask "webpquicklook"
vscode "aaron-bond.better-comments"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-power-mode"
vscode "innoverio.vscode-dbt-power-user"
vscode "jakearl.search-editor-apply-changes"
vscode "KevinRose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vsliveshare.vsliveshare"
vscode "nemesv.copy-file-name"
vscode "njpwerner.autodocstring"
vscode "Postman.postman-for-vscode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "Shinotatwu-DS.file-tree-generator"
vscode "SirTori.indenticator"
vscode "vmware.vscode-manifest-yaml"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
